// @strict-types
#Область ПрограммныйИнтерфейс

// Функция выполняет поиск комплектовщика по его табельному номеру.
// 
// Параметры:
//  ТабельныйНомер - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.Комплектовщики - Комлпектовщик с нужным табельным номером или пустая ссылка
Функция НайтиПоТабельномуНомеру(ТабельныйНомер) Экспорт

    Запрос = Новый Запрос("ВЫБРАТЬ
                          |    Комплектовщики.Ссылка КАК Комплектовщик
                          |ИЗ
                          |    Справочник.Комплектовщики КАК Комплектовщики
                          |ГДЕ
                          |    Комплектовщики.Идентификатор = &Идентификатор
                          |    И НЕ Комплектовщики.ПометкаУдаления");

    Запрос.УстановитьПараметр("Идентификатор", ТабельныйНомер);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

    Если Не Выборка.Следующий() Тогда

        Возврат ПустаяСсылка();

    КонецЕсли;
    
    //@skip-check property-return-type
    Комплектовщик = Выборка.Комплектовщик; // СправочникСсылка.Комплектовщики

    Возврат Комплектовщик;

КонецФункции

#КонецОбласти