// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет запись о штрихкоде.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  Штрихкод - Строка
//  Время - Дата
Процедура ДобавитьШтрихкод(Знач Процесс, Знач Сотрудник, Знач Штрихкод, Знач Время) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;
    Запись.Дата = Время;

    Запись.Записать();

КонецПроцедуры

// Процедура удаляет запись о штрихкоде.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  Штрихкод - Строка
Процедура УдалитьШтрихкод(Знач Процесс, Знач Сотрудник, Знач Штрихкод) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;

    Запись.Удалить();

КонецПроцедуры

// Процедура удаляет записи о штрихкодах сотрудника.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
Процедура УдалитьШтрихкодыСотрудника(Знач Процесс, Знач Сотрудник) Экспорт

    НаборЗаписей = СоздатьНаборЗаписей();

    НаборЗаписей.УдалитьДляСотрудника(Сотрудник, Процесс);

КонецПроцедуры

#КонецОбласти