// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура удаляет записи о штрихкодах сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
Процедура УдалитьДляСотрудника(Знач Сотрудник, Знач Процесс) Экспорт

    Отбор.Процесс.Установить(Процесс);
    Прочитать();

    ИндексыЗаписейДляУдаления = Новый Массив; // Массив из Число

    Для ИндексЗаписи = 0 По Количество() - 1 Цикл

        Если Получить(ИндексЗаписи).Сотрудник = Сотрудник Тогда

            ИндексыЗаписейДляУдаления.Вставить(0, ИндексЗаписи);

        КонецЕсли;

    КонецЦикла;

    Для Каждого Индекс Из ИндексыЗаписейДляУдаления Цикл

        Удалить(Индекс);

    КонецЦикла;

    Записать();

КонецПроцедуры

#КонецОбласти