// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;
    ФормаСписокЗаданий.Параметры.УстановитьЗначениеПараметра("Комплектовщик", ФормаКомплектовщик);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокЗаданий.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗаданий

// Процедура открывает форму для выполнения выбранного задания.
// 
// Параметры:
//  Элемент - ТаблицаФормы - Список заданий
//  Значение - ДокументСсылка.Задание - Выбранное задание
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокЗаданийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Документ", Значение);
    ПараметрыФормы.Вставить("Комплектовщик", ФормаКомплектовщик);

    ОткрытьФорму("Документ.Задание.Форма.ФормаВыполнения", ПараметрыФормы);

    Закрыть();

КонецПроцедуры

#КонецОбласти