// @strict-types
#Область ПрограммныйИнтерфейс

// Функция заменяет недопустимые символы XML на символ замены.
// 
// Параметры:
//  Текст - Строка
//  СимволЗамены - Строка - Символ замены
// 
// Возвращаемое значение:
//  Строка - Заменить недопустимые символы XML
Функция ЗаменитьНедопустимыеСимволы(Знач Текст, СимволЗамены = "") Экспорт

    ПозицияНачала = 1;
    
    //@skip-check bsl-legacy-check-static-feature-access
    Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);

    Пока Позиция > 0 Цикл

        НедопустимыйСимвол = Сред(Текст, Позиция, 1);

        Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);

        ПозицияНачала = Позиция + СтрДлина(СимволЗамены);

        Если ПозицияНачала > СтрДлина(Текст) Тогда

            Прервать;

        КонецЕсли;
        
        //@skip-check bsl-legacy-check-static-feature-access
        Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);

    КонецЦикла;

    Возврат Текст;

КонецФункции

#КонецОбласти