// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокИнвентаризацийОбуви.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокИнвентаризацийОбуви

// Процедура открывает форму для заполнения инвентаризации.
// 
// Параметры:
//  Элемент - ТаблицаФормы - Список заданий
//  Значение - ДокументСсылка.Задание - Выбранное задание
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокИнвентаризацийОбувиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ключ", Значение);
    ПараметрыФормы.Вставить("Комплектовщик", ФормаКомплектовщик);

    ОткрытьФорму("Документ.ИнвентаризацияСклад.Форма.ФормаВыполнения", ПараметрыФормы);
    
    Закрыть();

КонецПроцедуры

#КонецОбласти