// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет новую строку в табличную часть "ЗаданияНаОтбор" и
// записывает в нее номер короба.
// 
// Параметры:
//  НомерКороба - Строка
Процедура ЗаписатьНомерКороба(Знач НомерКороба) Экспорт

    НоваяСтрока = ТабличнаяЧасть.Добавить();
    НоваяСтрока.Короб = НомерКороба;
    Записать();

КонецПроцедуры

// Процедура добавляет новую строку в табличную часть "ЗаданияНаОтбор" и
// записывает в нее код маркировки.
// 
// Параметры:
//  КодМаркировки - Строка
Процедура ЗаписатьКодМаркировки(Знач КодМаркировки) Экспорт

    НоваяСтрока = ТабличнаяЧасть.Добавить();
    НоваяСтрока.КМ31 = КодМаркировки;
    Записать();

КонецПроцедуры

#КонецОбласти