// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудник = Параметры.Сотрудник;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

    Если Не ТекущийПользовательИмеетПравоВыполнятьПечатьЯрлыков() Тогда

        СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьПечатьЯрлыков);

    КонецЕсли;

    Если Не ТекущийПользовательИмеетПравоВыполнятьПечатьЭтикеток() Тогда

        СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьПечатьЭтикеток);

    КонецЕсли;

    Если Не ТекущийПользовательИмеетПравоВыполнятьФормированиеТележки() Тогда

        СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьФормированиеТележки);

    КонецЕсли;

    Если Не ТекущийПользовательИмеетПравоВыполнятьКонтроль() Тогда

        СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьКонтроль);

    КонецЕсли;

    Если Не ТекущийПользовательИмеетПравоВыполнятьРегистрацияОпераций() Тогда

        СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьРегистрацияОпераций);

    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессПечатьЯрлыков(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаПроизводстве.ПечатьЯрлыков"));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессПечатьЭтикеток(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаПроизводстве.ПечатьЭтикеток"));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессФормированиеТележки(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаПроизводстве.ФормированиеТележки"));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессКонтроль(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаПроизводстве.Контроль"));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессРегистрацияОпераций(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

	ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаПроизводстве.РегистрацияОпераций"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекущийПользовательИмеетПравоВыполнятьПечатьЯрлыков()

    //@skip-check reading-attribute-from-database
    Возврат ФормаСотрудник.ЕстьДоступПечатьЯрлыков;

КонецФункции

&НаСервере
Функция ТекущийПользовательИмеетПравоВыполнятьПечатьЭтикеток()

    //@skip-check reading-attribute-from-database
    Возврат ФормаСотрудник.ЕстьДоступПечатьЭтикеток;

КонецФункции

&НаСервере
Функция ТекущийПользовательИмеетПравоВыполнятьФормированиеТележки()

    //@skip-check reading-attribute-from-database
    Возврат ФормаСотрудник.ЕстьДоступФормированиеТележек;

КонецФункции

&НаСервере
Функция ТекущийПользовательИмеетПравоВыполнятьКонтроль()

    //@skip-check reading-attribute-from-database
    Возврат ФормаСотрудник.ЕстьДоступКонтроль;

КонецФункции

&НаСервере
Функция ТекущийПользовательИмеетПравоВыполнятьРегистрацияОпераций()

    //@skip-check reading-attribute-from-database
    Возврат ФормаСотрудник.ЕстьДоступРегистрацияОпераций;

КонецФункции

// Процедура добавляет астериск в начале заголовка и отключает доступность кнопки.
// 
// Параметры:
//  Кнопка - КнопкаФормы
&НаКлиенте
Процедура СделатьКнопкуНедоступной(Кнопка)

    Кнопка.Заголовок = "* " + Кнопка.Заголовок;
    Кнопка.Доступность = Ложь;

КонецПроцедуры

// Открыть форму выполнения.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаПроизводстве
&НаКлиенте
Процедура ОткрытьФормуВыполнения(Процесс)
	
    ПараметрыФормы = Новый Структура("Сотрудник, Процесс", ФормаСотрудник, Процесс);
    Если Процесс = ПредопределенноеЗначение("Перечисление.ПроцессНаПроизводстве.РегистрацияОпераций") Тогда
    	
    	ОткрытьФорму("Обработка.ВыполнениеЗаданийНаПроизводстве.Форма.ФормаРегистрацииОпераций", ПараметрыФормы);
    	
    Иначе
    
    	ОткрытьФорму("Обработка.ВыполнениеЗаданийНаПроизводстве.Форма.ФормаВыполнения", ПараметрыФормы);
    	
    КонецЕсли

КонецПроцедуры

#КонецОбласти