// @strict-types
#Область ПрограммныйИнтерфейс

// Записать ошибку.
// 
// Параметры:
//  Дата - Дата
//  Задание - ДокументСсылка.Задание
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  ВидОшибки - ПеречислениеСсылка.ВидОшибки
//  НомерЗаданияНаОтбор - Неопределено, Число - Номер строки в табличной части "ЗаданиеНаОтбор"
//  ТШК - Неопределено, Строка - ТШК
//  КодМаркировки - Неопределено, Строка - Код маркировки
Процедура ЗаписатьОшибку(Знач Дата,
                         Знач Задание,
                         Знач Комплектовщик,
                         Знач ВидОшибки,
                         Знач НомерЗаданияНаОтбор = Неопределено,
                         Знач ТШК = Неопределено,
                         Знач КодМаркировки = Неопределено) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Идентфикатор = Новый УникальныйИдентификатор;

    Запись.Дата = Дата;
    Запись.Задание = Задание;
    Запись.Комплектовщик = Комплектовщик;
    Запись.ВидОшибки = ВидОшибки;

    Запись.НомерЗаданияНаОтбор = НомерЗаданияНаОтбор;
    Запись.ТШК = ТШК;
    Запись.КодМаркировки = КодМаркировки;

    Запись.Записать();

КонецПроцедуры

#КонецОбласти