// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура записывает информацию об ошибке.
// 
// Параметры:
//  Задание - ДокументСсылка.Задание
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  ВидОшибки - ПеречислениеСсылка.ВидОшибкиКонтроляОтбора
//  НомерЗаданияНаОтбор - Неопределено, Число - Номер строки в табличной части "ЗаданияНаОтбор"
//  ТШК - Неопределено, Строка - ТШК
//  КодМаркировки - Неопределено, Строка - Код маркировки
Процедура ЗаписатьОшибку(Знач Задание,
                         Знач Комплектовщик,
                         Знач ВидОшибки,
                         Знач НомерЗаданияНаОтбор = Неопределено,
                         Знач ТШК = Неопределено,
                         Знач КодМаркировки = Неопределено) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Идентфикатор = Новый УникальныйИдентификатор;

    Запись.Дата = ТекущаяДатаСеанса();
    Запись.Задание = Задание;
    Запись.Комплектовщик = Комплектовщик;
    Запись.ВидОшибки = ВидОшибки;

    Запись.НомерЗаданияНаОтбор = НомерЗаданияНаОтбор;

    Если ТШК <> Неопределено Тогда

        ШтрихкодыКлиентСервер.Сериализовать(ТШК);
        Запись.ТШК = ТШК;

    КонецЕсли;

    Если КодМаркировки <> Неопределено Тогда

        ШтрихкодыКлиентСервер.Сериализовать(КодМаркировки);
        Запись.КодМаркировки = КодМаркировки;

    КонецЕсли;

    Запись.Записать();

КонецПроцедуры

#КонецОбласти