// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессПеремещение(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаДесме.Перемещение"));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессПрием(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли

    ОткрытьФормуВыполнения(ПредопределенноеЗначение("Перечисление.ПроцессНаДесме.Прием"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Открыть форму выполнения.
// 
// Параметры:
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
&НаКлиенте
Процедура ОткрытьФормуВыполнения(Процесс)

    ПараметрыФормы = Новый Структура("Комплектовщик, Процесс", ФормаКомплектовщик, Процесс);
    ОткрытьФорму("Обработка.ВыполнениеЗаданийДесмы.Форма.ФормаВыполнения", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти