// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудник = Параметры.Сотрудник;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокПересчетовТоваров.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПересчетовТоваров

// Процедура открывает форму для заполнения перемещения товаров.
// 
// Параметры:
//  Элемент - ТаблицаФормы
//  Значение - Произвольный
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокПересчетовТоваровВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Документ", Значение);
    ПараметрыФормы.Вставить("Сотрудник", ФормаСотрудник);

    ОткрытьФорму("Документ.ПересчетТоваров.Форма.ФормаВыполнения", ПараметрыФормы); 
    
    Закрыть();

КонецПроцедуры

#КонецОбласти