// @strict-types
#Область ПрограммныйИнтерфейс

// Функция возвращает код, указывающий на отсутствие ошибки.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаУспех() Экспорт

    Возврат 0;

КонецФункции

// Функция возвращает код, указывающий на то, что в табличной части "ЗаданиеНаОтбор"
// у документа "Задание" не было найдено строки, соответствующей штрихкоду.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду() Экспорт

    Возврат 400;

КонецФункции

#КонецОбласти