// @strict-types
#Область ПрограммныйИнтерфейс

// Функция возвращает код, указывающий на отсутствие ошибки.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаУспех() Экспорт

    Возврат 0;

КонецФункции

#Область КонтрольОтбора

// Функция возвращает код, указывающий на то, что в табличной части "ЗаданиеНаОтбор"
// у документа "Задание" не было найдено строки, соответствующей штрихкоду.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду() Экспорт

    Возврат 400;

КонецФункции

// Функция возвращает код, указывающий на то, что в коробе больше пар,
// чем нужно по заданию.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаСлишкомМногоВКоробе() Экспорт

    Возврат 401;

КонецФункции

// Функция возвращает код, указывающий на то, что у задания отсутствует
// документ на перемещение.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаОтсутствуетДокументНаВнутреннееПеремещение() Экспорт

    Возврат 402;

КонецФункции

// Функция возвращает код, указывающий на то, что штрихкод уже был обработан
// другим комплектовщиком.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаШтрихкодУжеПроведенДругим() Экспорт

    Возврат 421;

КонецФункции

// Функция возвращает код, указывающий на то, что штрихкод уже был обработан.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаШтрихкодУжеПроведен() Экспорт

    Возврат 420;

КонецФункции

// Функция возвращает код, указывающий на то, что произошла ошибка при проверке
// штрихкода.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаОшибкаПроверкиПроведенияШтрихкода() Экспорт

    Возврат 426;

КонецФункции

#КонецОбласти

#Область МаркировкаИПрослеживаемость

// Функция возвращает код, указывающий на то, что в табличной части "КодыМаркировки"
// у документа "АктПриемкиТоваров" не удалось найти строку, соответствующую коду маркировки.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаНеНайденКодМаркировки() Экспорт

    Возврат 1010;

КонецФункции

// Функция возвращает код, указывающий на то, что код маркировки уже был проверен.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаКодМаркировкиУжеПроверен() Экспорт

    Возврат 1011;

КонецФункции

// Функция возвращает код, указывающий на то, что количество поставленного меньше принятого в акте приемке товаров.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаКоличествоПоставленногоМеньшеПринятого() Экспорт

    Возврат 1100;

КонецФункции

#КонецОбласти

#КонецОбласти