// @strict-types
#Область ПрограммныйИнтерфейс

// Функция возвращает код, указывающий на отсутствие ошибки.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаУспех() Экспорт

    Возврат 0;

КонецФункции

#Область КонтрольОтбора

// Функция возвращает код, указывающий на то, что в табличной части "ЗаданиеНаОтбор"
// у документа "Задание" не было найдено строки, соответствующей штрихкоду.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду() Экспорт

    Возврат 1000;

КонецФункции

// Функция возвращает код, указывающий на то, что в коробе больше пар,
// чем нужно по заданию.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаСлишкомМногоВКоробе() Экспорт

    Возврат 1001;

КонецФункции

// Функция возвращает код, указывающий на то, что у задания отсутствует
// документ на перемещение.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаОтсутствуетДокументНаВнутреннееПеремещение() Экспорт

    Возврат 1002;

КонецФункции

// Функция возвращает код, указывающий на то, что штрихкод уже был обработан.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаШтрихкодУжеПроведен() Экспорт

    Возврат 1003;

КонецФункции

// Функция возвращает код, указывающий на то, что штрихкод уже был обработан
// другим комплектовщиком.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаШтрихкодУжеПроведенДругим() Экспорт

    Возврат 1004;

КонецФункции

// Функция возвращает код, указывающий на то, что произошла ошибка при проверке
// штрихкода.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаОшибкаПроверкиПроведенияШтрихкода() Экспорт

    Возврат 1005;

КонецФункции

#КонецОбласти

#Область ИнвентаризацияОбуви

// Функция возвращает код, указывающий на то, что штрихкод уже был обработан.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаШтрихкодУжеОтсканирован() Экспорт

    Возврат 2000;

КонецФункции

// Функция возвращает код, указывающий на то, что штрихкод уже был обработан
// другим комплектовщиком.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаШтрихкодУжеОтсканированДругим() Экспорт

    Возврат 2001;

КонецФункции

#КонецОбласти

#Область МаркировкаИПрослеживаемость

// Функция возвращает код, указывающий на то, что в не удалось найти карточку номенклатуры,
// соответствующую штрихкоду.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаНеНайденаНоменклатура() Экспорт

    Возврат 3000;

КонецФункции

// Функция возвращает код, указывающий на то, что в не удалось найти карточку номенклатуры,
// соответствующую штрихкоду.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаНовыйШтрихкод() Экспорт

    Возврат 3001;

КонецФункции

// Функция возвращает код, указывающий на то, что в табличной части "КодыМаркировки"
// у документа "АктПриемкиТоваров" не удалось найти строку, соответствующую коду маркировки.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаНеНайденКодМаркировки() Экспорт

    Возврат 3002;

КонецФункции

// Функция возвращает код, указывающий на то, что код маркировки уже был проверен.
// 
// Возвращаемое значение:
//  Число - Код возврата
Функция КодВозвратаКодМаркировкиУжеПроверен() Экспорт

    Возврат 3003;

КонецФункции

#КонецОбласти

#КонецОбласти