// @strict-types
#Область ОписаниеПеременных

Перем ВнешниеКомпоненты; // См. ВнешниеКомпонентыКлиент.НоваяКоллекцияВнешнихКомпонент

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)
    
    // Создание коллекции для хранения внешних компонент
    ВнешниеКомпоненты = ВнешниеКомпонентыКлиент.НоваяКоллекцияВнешнихКомпонент();

    // Подключение, установка и настройка внешних компонент
    ВнешниеКомпонентыКлиент.НастроитьВнешниеКомпоненты(ВнешниеКомпоненты);

КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    ОткрытьФорму("Обработка.ВыполнениеЗаданий.Форма.ФормаВыбораСотрудника");

#КонецЕсли

КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

    // Подготовка данных
    ОписаниеСобытия = ВнешниеКомпонентыКлиент.НовоеОписаниеВнешнегоСобытия();
    ОписаниеСобытия.Источник = Источник;
    ОписаниеСобытия.Событие = Событие;
    ОписаниеСобытия.Данные = Данные;

    // Вызов обработчиков внешнего события
    ВнешниеКомпонентыКлиент.ОбработатьВнешнееСобытие(ОписаниеСобытия, ВнешниеКомпоненты);

КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

    // Отключение подключенных внешних компонент
    ВнешниеКомпонентыКлиент.ОтключитьВнешниеКомпоненты(ВнешниеКомпоненты);

КонецПроцедуры

#КонецОбласти