// @strict-types
#Область ОписаниеПеременных

Перем ВнешниеКомпоненты; // См. МенеджерВнешниеКомпонентыКлиент.НоваяКоллекцияВнешнихКомпонент

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)
    
    // Создание коллекции для хранения внешних компонент
    ВнешниеКомпоненты = МенеджерВнешниеКомпонентыКлиент.НоваяКоллекцияВнешнихКомпонент();

    // Подключение, установка и настройка внешних компонент
    МенеджерВнешниеКомпонентыКлиент.НастроитьВнешниеКомпоненты(ВнешниеКомпоненты);

КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    МенеджерЗаданияКлиент.НачатьВыполнениеЗадания();

#КонецЕсли

КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

    // Подготовка данных
    ОписаниеСобытия = МенеджерВнешниеКомпонентыКлиент.НовоеОписаниеВнешнегоСобытия();
    ОписаниеСобытия.Источник = Источник;
    ОписаниеСобытия.Событие = Событие;
    ОписаниеСобытия.Данные = Данные;

    // Вызов обработчиков внешнего события
    МенеджерВнешниеКомпонентыКлиент.ОбработатьВнешнееСобытие(ОписаниеСобытия, ВнешниеКомпоненты);

КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

    // Отключение подключенных внешних компонент
    МенеджерВнешниеКомпонентыКлиент.ОтключитьВнешниеКомпоненты(ВнешниеКомпоненты);

КонецПроцедуры

#КонецОбласти