// @strict-types
#Область ОписаниеПеременных

Перем ВнешниеКомпоненты; // См. ВнешниеКомпонентыМенеджерКлиент.НоваяКоллекцияВнешнихКомпонент

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)
    
    // Создание коллекции для хранения внешних компонент
    ВнешниеКомпоненты = ВнешниеКомпонентыМенеджерКлиент.НоваяКоллекцияВнешнихКомпонент();

    // Подключение, установка и настройка внешних компонент
    ВнешниеКомпонентыМенеджерКлиент.НастроитьВнешниеКомпоненты(ВнешниеКомпоненты);

КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    ВыполнениеЗаданийКлиент.НачатьВыполнениеЗадания();

#КонецЕсли

КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

    // Подготовка данных
    ОписаниеСобытия = ВнешниеКомпонентыМенеджерКлиент.НовоеОписаниеВнешнегоСобытия();
    ОписаниеСобытия.Источник = Источник;
    ОписаниеСобытия.Событие = Событие;
    ОписаниеСобытия.Данные = Данные;

    // Вызов обработчиков внешнего события
    ВнешниеКомпонентыМенеджерКлиент.ОбработатьВнешнееСобытие(ОписаниеСобытия, ВнешниеКомпоненты);

КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

    // Отключение подключенных внешних компонент
    ВнешниеКомпонентыМенеджерКлиент.ОтключитьВнешниеКомпоненты(ВнешниеКомпоненты);

КонецПроцедуры

#КонецОбласти