// @strict-types
#Область ОписаниеПеременных

Перем ВнешниеКомпоненты; // См. ВнешниеКомпонентыМенеджерКлиент.СоздатьКоллекциюВнешнихКомпонент

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ)

	// Получение коллекции подключенных внешних компонент
    ВнешниеКомпоненты = ВнешниеКомпонентыМенеджерКлиент.НастроитьВнешниеКомпоненты();

КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	// Подготовка данных
    ОписаниеСобытия = ВнешниеКомпонентыМенеджерКлиент.СоздатьОписаниеВнешнегоСобытия();
    ОписаниеСобытия.Источник = Источник;
    ОписаниеСобытия.Событие = Событие;
    ОписаниеСобытия.Данные = Данные;

	// Обработка внешнего события так, как это запрограммировано для каждой их внешних компонент
    ВнешниеКомпонентыМенеджерКлиент.ОбработатьВнешнееСобытие(ОписаниеСобытия, ВнешниеКомпоненты);

КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

	// Отключение подключенных внешних компонент
    ВнешниеКомпонентыМенеджерКлиент.ОтключитьВнешниеКомпоненты(ВнешниеКомпоненты);

КонецПроцедуры

#КонецОбласти