// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудник = Параметры.Сотрудник;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокПеремещений.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПеремещений

// Процедура открывает форму для заполнения перемещения товаров.
// 
// Параметры:
//  Элемент - ТаблицаФормы
//  Значение - Произвольный
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокПеремещенийТоваровВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ключ", Значение);
    ПараметрыФормы.Вставить("Сотрудник", ФормаСотрудник);

    ОткрытьФорму("Документ.ПеремещениеТоваров.Форма.ФормаЗаполнения", ПараметрыФормы); 
	
	Закрыть();

КонецПроцедуры

#КонецОбласти