// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура устанавливает и подключает внешние компоненты. Если при установке
// или подключении внешней компоненты возникает ошибка, процедура вызывает исключение.
// 
// Параметры:
//  ВнешниеКомпоненты - См. НоваяКоллекцияВнешнихКомпонент
Процедура НастроитьВнешниеКомпоненты(ВнешниеКомпоненты) Экспорт

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Настройка драйвера для сканера Newland N7 Cachalot Pro и добавление в коллекцию внешних компонент
    СканерШтрихкодаNewlandN7CachalotProКлиент.НастроитьДрайвер(ВнешниеКомпоненты);

#КонецЕсли

КонецПроцедуры

// Процедура обрабатывает сообщения внешних компонент.
// 
// Параметры:
//  ОписаниеВнешнегоСобытия - См. НовоеОписаниеВнешнегоСобытия
//  ВнешниеКомпоненты - См. НоваяКоллекцияВнешнихКомпонент
Процедура ОбработатьВнешнееСобытие(ОписаниеВнешнегоСобытия, ВнешниеКомпоненты) Экспорт

    Если ЗначениеЗаполнено(ВнешниеКомпоненты) Тогда

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

        // Проверка того, что драйвер сканера Newland N7 Cachalot Pro был настроен
        Если ВнешниеКомпоненты[СканерШтрихкодаNewlandN7CachalotProКлиент.КлючВнешнейКомпоненты()] <> Неопределено Тогда

            // Обработка сканирования штрихкода на сканере Newland N7 Cachalot Pro
            СканерШтрихкодаNewlandN7CachalotProКлиент.ОбработатьВнешнееСобытие(ОписаниеВнешнегоСобытия);
            Возврат;

        КонецЕсли;

#КонецЕсли

    КонецЕсли;

КонецПроцедуры

// Процедура отключает внешние компоненты.
// 
// Параметры:
//  ВнешниеКомпоненты - См. НоваяКоллекцияВнешнихКомпонент
Процедура ОтключитьВнешниеКомпоненты(ВнешниеКомпоненты) Экспорт

    Для Каждого КлючИЗначение Из ВнешниеКомпоненты Цикл

        ИмяВнешнейКомпоненты = КлючИЗначение.Ключ;
        ВнешняяКомпонента = КлючИЗначение.Значение;

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

        Если ИмяВнешнейКомпоненты = СканерШтрихкодаNewlandN7CachalotProКлиент.КлючВнешнейКомпоненты() Тогда

            // Отключение драйвера для сканера Newland N7 Cachalot Pro
            СканерШтрихкодаNewlandN7CachalotProКлиент.ОтключитьДрайвер(ВнешняяКомпонента);

        КонецЕсли;

#КонецЕсли

    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция создает новую коллекцию для внешних компонент.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - Коллекция для внешних компонент:
// * Ключ - Строка
// * Значение - Произвольный
Функция НоваяКоллекцияВнешнихКомпонент() Экспорт

    Возврат Новый Соответствие;

КонецФункции

// Функция создает описание внешнего события.
// 
// Возвращаемое значение:
//  Структура - Описание внешнего события:
// * Источник - Строка - Источник события
// * Событие - Строка - Имя события
// * Данные - Строка - Данные события
Функция НовоеОписаниеВнешнегоСобытия() Экспорт

    Возврат Новый Структура("Источник, Событие, Данные", "", "", "");

КонецФункции

#КонецОбласти