// @strict-types
#Область ПрограммныйИнтерфейс

// См. КодыВозвратаСерверГлобальный.КодВозвратаУспех
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаУспех(КодВозврата) Экспорт

    Возврат КодВозврата = 0;

КонецФункции

#Область КонтрольОтбора

// См. КодыВозвратаСерверГлобальный.КодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду(КодВозврата) Экспорт

    Возврат КодВозврата = 400;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаСлишкомМногоВКоробе
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаСлишкомМногоВКоробе(КодВозврата) Экспорт

    Возврат КодВозврата = 401;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаОтсутствуетДокументНаВнутреннееПеремещение
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаОтсутствуетДокументНаВнутреннееПеремещение(КодВозврата) Экспорт

    Возврат КодВозврата = 402;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаШтрихкодУжеПроведенДругим
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаШтрихкодУжеПроведенДругим(КодВозврата) Экспорт

    Возврат КодВозврата = 421;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаШтрихкодУжеПроведен
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаШтрихкодУжеПроведен(КодВозврата) Экспорт

    Возврат КодВозврата = 420;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаОшибкаПроверкиПроведенияШтрихкода
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаОшибкаПроверкиПроведенияШтрихкода(КодВозврата) Экспорт

    Возврат КодВозврата = 426;

КонецФункции

#КонецОбласти

#Область МаркировкаИПрослеживаемость

// См. КодыВозвратаСерверГлобальный.КодВозвратаНеНайденКодМаркировки
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаНеНайденКодМаркировки(КодВозврата) Экспорт

    Возврат КодВозврата = 1010;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаКодМаркировкиУжеПроверен
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаКодМаркировкиУжеПроверен(КодВозврата) Экспорт

    Возврат КодВозврата = 1011;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаКоличествоПоставленногоМеньшеПринятого
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаКоличествоПоставленногоМеньшеПринятого(КодВозврата) Экспорт

    Возврат КодВозврата = 1100;

КонецФункции

#КонецОбласти

#КонецОбласти