// @strict-types
#Область ПрограммныйИнтерфейс

// См. КодыВозвратаСерверГлобальный.КодВозвратаУспех
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаУспех(КодВозврата) Экспорт

    Возврат КодВозврата = 0;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду(КодВозврата) Экспорт

    Возврат КодВозврата = 400;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаСлишкомМногоВКоробе
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаСлишкомМногоВКоробе(КодВозврата) Экспорт

    Возврат КодВозврата = 401;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаОтсутствуетДокументНаВнутреннееПеремещение
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаОтсутствуетДокументНаВнутреннееПеремещение(КодВозврата) Экспорт

    Возврат КодВозврата = 402;

КонецФункции


#КонецОбласти