// @strict-types
#Область ПрограммныйИнтерфейс

// См. КодыВозвратаСерверГлобальный.КодВозвратаУспех
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаУспех(КодВозврата) Экспорт

    Возврат КодВозврата = 0;

КонецФункции

// См. КодыВозвратаСерверГлобальный.КодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду
// 
// Параметры:
//  КодВозврата - Число
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду(КодВозврата) Экспорт

    Возврат КодВозврата = 400;

КонецФункции


#КонецОбласти