// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет запись о штрихкоде.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  КодОперации - Строка
//  Штрихкод - Строка
//  Время - Дата
Процедура ДобавитьШтрихкод(Знач Сотрудник, Знач КодОперации, Знач Штрихкод, Знач Время) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.КодОперации = КодОперации;
    Запись.Штрихкод = Штрихкод;
    Запись.Дата = Время;

    Запись.Записать();

КонецПроцедуры

// Процедура удаляет запись о штрихкоде.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
//  КодОперации - Строка
//  Штрихкод - Строка
Процедура УдалитьШтрихкод(Знач Сотрудник, Знач КодОперации, Знач Штрихкод) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Сотрудник = Сотрудник;
    Запись.КодОперации = КодОперации;
    Запись.Штрихкод = Штрихкод;

    Запись.Удалить();

КонецПроцедуры

// Процедура удаляет записи о штрихкодах сотрудника.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиНаПроизводстве
Процедура УдалитьШтрихкодыСотрудника(Знач Сотрудник) Экспорт

    НаборЗаписей = СоздатьНаборЗаписей();

    НаборЗаписей.УдалитьДляСотрудника(Сотрудник);

КонецПроцедуры

#КонецОбласти