// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудникСклада = Параметры.СотрудникСклада;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессПриемку(Команда)
    
    ОповещенияПользователяКлиент.ПоказатьОповещение("Выбран процесс", "Приемка", ИмяФормы);

КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПроцессИнвентаризацию(Команда)
    
    ОповещенияПользователяКлиент.ПоказатьОповещение("Выбран процесс", "Инвентаризация", ИмяФормы);

КонецПроцедуры

#КонецОбласти

