// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудникСклада = Параметры.СотрудникСклада;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессПриход(Команда)
    
    ОповещенияПользователяКлиент.ПоказатьОповещение("Выбран процесс", "Приход", ИмяФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессПеремещение(Команда)
	
	ОповещенияПользователяКлиент.ПоказатьОповещение("Процесс не поддерживается", "Перемещение", ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессИнвентаризацию(Команда)
    
    ОповещенияПользователяКлиент.ПоказатьОповещение("Процесс не поддерживается", "Инвентаризация", ИмяФормы);

КонецПроцедуры

#КонецОбласти

