// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудникСклада = Параметры.СотрудникСклада;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессПриход(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли
   
    // Открытие формы выбора 
    ПараметрыФормы = Новый Структура("Сотрудник", ФормаСотрудникСклада);
    ОткрытьФорму("Обработка.ПроверкаЭлектронныхНакладных.Форма.ФормаВыбораЭлектроннойНакладнойДляПроверки",
                 ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессПеремещение(Команда)

    ОповещенияПользователяКлиент.ПоказатьОповещение("Процесс не поддерживается", "Перемещение", ИмяФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессИнвентаризацию(Команда)

    ОповещенияПользователяКлиент.ПоказатьОповещение("Процесс не поддерживается", "Инвентаризация", ИмяФормы);

КонецПроцедуры

#КонецОбласти