// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет запись о штрихкоде.
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
//  Штрихкод - Строка
//  Время - Дата
Процедура ДобавитьШтрихкод(Знач Комплектовщик, Знач Процесс, Знач Штрихкод, Знач Время) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Комплектовщик = Комплектовщик;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;
    Запись.Дата = Время;

    Запись.Записать();

КонецПроцедуры

// Процедура удаляет запись о штрихкоде.
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
//  Штрихкод - Строка
Процедура УдалитьШтрихкод(Знач Комплектовщик, Знач Процесс, Знач Штрихкод) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Комплектовщик = Комплектовщик;
    Запись.Штрихкод = Штрихкод;
    Запись.Процесс = Процесс;

    Запись.Удалить();

КонецПроцедуры

// Процедура удаляет записи о штрихкодах комплектовщика.
// 
// Параметры:
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  Процесс - ПеречислениеСсылка.ПроцессНаДесме
Процедура УдалитьШтрихкодыКомплектовщика(Знач Комплектовщик, Знач Процесс) Экспорт

    НаборЗаписей = СоздатьНаборЗаписей();

    НаборЗаписей.Отбор.Комплектовщик.Установить(Комплектовщик);
    НаборЗаписей.Отбор.Процесс.Установить(Процесс);

    НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти