// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;
    ФормаСписокЗаданий.Параметры.УстановитьЗначениеПараметра("Комплектовщик", ФормаКомплектовщик);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
    
    Элементы.СписокЗаданий.Шапка = Ложь;
    
#КонецЕсли

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗаданий

// Процедура открывает форму для выполнения выбранного задания.
// 
// Параметры:
//  Элемент - ТаблицаФормы - Список заданий
//  Значение - ДокументСсылка.Задание - Выбранное задание
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаКлиенте
Процедура СписокЗаданийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
    
    // Чтобы текущая форма осталась открытой
    СтандартнаяОбработка = Ложь;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Задание", Значение);
    ПараметрыФормы.Вставить("Комплектовщик", ФормаКомплектовщик);

    ОткрытьФорму("Документ.Задание.Форма.ВыполнениеЗадания", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти