#Область ПрограммныйИнтерфейс

// Процедура устанавливает флаг, указывающий на то, что заполнение документа завершено.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.СотрудникиСклада
Процедура ЗавершитьПроверку(Знач Сотрудник) Экспорт

    СотрудникЗаполнившийПеремещение = Сотрудник;
    ЗаполнениеЗавершено = Истина;

    Записать();

КонецПроцедуры

// Процедура обновляет количество товара.
// 
// Параметры:
//  НомерТовара - Число - Номер строки табличной части Товары
//  НовоеКоличествоТовара - Число
Процедура ОбновитьКоличествоТовара(Знач НомерТовара, Знач НовоеКоличествоТовара) Экспорт
                                            
    // 1. Получение строки табличной части Номенклатура
    Товар = Товары.Получить(НомерТовара - 1);
    
    // 2. Обновление количества принятого товара
    Товар.Количество = НовоеКоличествоТовара;

    Записать();

КонецПроцедуры

#КонецОбласти