// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает имя события сканирования штрихкода.
// 
// Возвращаемое значение:
//  Строка
Функция ИмяСобытияСканированияШтрихкода() Экспорт

    Возврат "Штрихкод";

КонецФункции

#Область ОписаниеРезультатовВыбора

// Функция создает описание результата выбора количества.
// 
// Возвращаемое значение:
//  Структура - Результат выбора:
// * ИдентификаторТовара - Строка, Число - Необходимо для обновления количества у товара
// * ИсходноеЗначение - Число
// * НовоеЗначение - Число
// * ВыбраноУдаление - Булево
Функция ОписаниеРезультатаИзмененияКоличестваТовара() Экспорт

    Результат = Новый Структура;

    Результат.Вставить("ИдентификаторТовара", "");
    Результат.Вставить("ИсходноеЗначение", 0);
    Результат.Вставить("НовоеЗначение", 0);
    Результат.Вставить("ВыбраноУдаление", Ложь);

    Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти