#Область ПрограммныйИнтерфейс

// Функция определяет тип штрихкода.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипШтрихкода, Неопределено - Тип штрихкода
Функция ТипШтрихкода(Штрихкод) Экспорт

    ДлинаШтрихкода = СтрДлина(Штрихкод);
    
    Если ДлинаШтрихкода = 8 Тогда

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.НомерЯчейки");

    ИначеЕсли ДлинаШтрихкода = 9 Тогда

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.НомерКороба");

    ИначеЕсли ДлинаШтрихкода = 19 Тогда

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.ТШК");

    ИначеЕсли ДлинаШтрихкода > 31 Тогда

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.КодМаркировки");

    КонецЕсли;

    Возврат Неопределено;

КонецФункции

#КонецОбласти