// @strict-types
#Область ПрограммныйИнтерфейс

// Функция определяет содержит ли акт приемки товаров данный код маркировки, был ли
// он уже обработан, и увеличивает счетчик с количеством принятого товара.
// 
// Параметры:
//  АктПриемкиТоваров - ДокументСсылка.АктПриемкиТоваров
//  КодМаркировки - Строка
// 
// Возвращаемое значение:
//  См. НовоеОписаниеОбработкиШтрихкода
Функция ОбработатьКодМаркировки(Знач АктПриемкиТоваров, Знач КодМаркировки) Экспорт

    НачатьТранзакцию();

    Попытка

        ОписаниеОбработкиШтрихкода = НовоеОписаниеОбработкиШтрихкода();
        
        // 1. Поиск строки табличной части "Номенклатура", подходящей коду маркировки
        Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                              |    ВсяНоменклатура.НомерСтроки КАК НомерСтроки,
                              |    ВсяНоменклатура.Номенклатура КАК Номенклатура,
                              |    ВсяНоменклатура.КоличествоПоставленногоТовара КАК КоличествоПоставленногоТовара,
                              |    ВсяНоменклатура.КоличествоПринятогоТовара КАК КоличествоПринятогоТовара
                              |ИЗ
                              |    Документ.АктПриемкиТоваров.Номенклатура КАК ВсяНоменклатура
                              |ГДЕ
                              |    ВсяНоменклатура.Ссылка = &Документ
                              |    И ВсяНоменклатура.КлючСвязи В
                              |        (ВЫБРАТЬ ПЕРВЫЕ 1
                              |            ВсеКодыМаркировки.КлючСвязи
                              |        ИЗ
                              |            Документ.АктПриемкиТоваров.КодыМаркировки КАК ВсеКодыМаркировки
                              |        ГДЕ
                              |            ВсеКодыМаркировки.Ссылка = &Документ
                              |            И ВсеКодыМаркировки.КодМаркировки = &КодМаркировки)");

        Запрос.УстановитьПараметр("КодМаркировки", КодМаркировки);
        Запрос.УстановитьПараметр("Документ", АктПриемкиТоваров);
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();

        Если Не Выборка.Следующий() Тогда

            ОтменитьТранзакцию();

            ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаНеНайденКодМаркировки();

            Возврат ОписаниеОбработкиШтрихкода;

        КонецЕсли;

        ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаУспех();
        ОписаниеОбработкиШтрихкода.НомерНоменклатуры = 1;
        ОписаниеОбработкиШтрихкода.ПредыдущееКоличество = 3;
        ОписаниеОбработкиШтрихкода.НовоеКоличество = 2;

        Возврат ОписаниеОбработкиШтрихкода;

    Исключение

        ОтменитьТранзакцию();
        ВызватьИсключение;

    КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция создает описание обработки штрихкода.
// 
// Возвращаемое значение:
//  Структура - Описание обработки штрихкода:
// * КодВозврата - Число - Код, указывающий на результат обработки штрихкода
// * НомерНоменклатуры - Неопределено, Число - Номер строки табличной части "Номенклатура" документа "АктПриемкиТоваров",
//                                             которой соответствовал обрабатываемый штрихкод
// * ПредыдущееКоличество - Неопределено, Число - Значение реквизита "КоличествоПринятогоТовара" до обработки штрихкода
// * НовоеКоличество - Неопределено, Число - Значение реквизита "КоличествоПринятогоТовара" после обработки штрихкода
Функция НовоеОписаниеОбработкиШтрихкода() Экспорт

    ОписаниеОбработкиШтрихкода = Новый Структура;

    ОписаниеОбработкиШтрихкода.Вставить("КодВозврата", КодВозвратаУспех());
    ОписаниеОбработкиШтрихкода.Вставить("НомерНоменклатуры", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("ПредыдущееКоличество", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("НовоеКоличество", Неопределено);

    Возврат ОписаниеОбработкиШтрихкода;

КонецФункции

#КонецОбласти