// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудник = Параметры.Сотрудник;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЭлектронныхНакладных

// Процедура открывает форму для проверки электронной накладной.
// 
// Параметры:
//  Элемент - ТаблицаФормы
//  Значение - Произвольный
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокЭлектронныхНакладныхВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ключ", Значение);
    ПараметрыФормы.Вставить("Сотрудник", ФормаСотрудник);

    ОткрытьФорму("Документ.АктПриемкиТоваров.Форма.ФормаПроверкиАктаПриемкиТоваров", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти