// @strict-types
#Область ПрограммныйИнтерфейс

// Функция заменяет недопустимые символы XML на символ замены.
// 
// Параметры:
//  Текст - Строка
//  СимволЗамены - Строка - Символ замены
// 
// Возвращаемое значение:
//  Строка - Заменить недопустимые символы XML
Функция ЗаменитьНедопустимыеСимволы(Знач Текст, СимволЗамены = "#") Экспорт
    
    //@skip-check bsl-legacy-check-static-feature-access
    Позиция = НайтиНедопустимыеСимволыXML(Текст);

    Пока Позиция > 0 Цикл

        ТекущийСимвол = Сред(Текст, Позиция, 1);

        Если КодСимвола(ТекущийСимвол) = 21 Тогда

            Текст = СтрЗаменить(Текст, ТекущийСимвол, Символ(167));
            
            //@skip-check bsl-legacy-check-static-feature-access
            Позиция = НайтиНедопустимыеСимволыXML(Текст);

            Продолжить;

        КонецЕсли;

        Текст = СтрЗаменить(Текст, ТекущийСимвол, СимволЗамены);
        
        //@skip-check bsl-legacy-check-static-feature-access
        Позиция = НайтиНедопустимыеСимволыXML(Текст);

    КонецЦикла;

    Возврат Текст;

КонецФункции

#КонецОбласти