// @strict-types
#Область ПрограммныйИнтерфейс

#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда

// Процедура воспроизводит звуковой сигнал.
// 
// Параметры:
//  КодВозврата - Число - См. КодыВозвратаСерверГлобальный
Процедура ВоспроизвестиЗвуковоеОповещениеДляКодаВозврата(Знач КодВозврата) Экспорт

    Звук = ЗвукПоКодуВозврата(КодВозврата);
    Вибрация = Истина;

    СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение(Звук, Вибрация);

КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает имя звука, соответствующего коду возврата.
// 
// Параметры:
//  КодВозврата - Число - См. КодыВозвратаСерверГлобальный
// 
// Возвращаемое значение:
//  Неопределено, Строка - Звук, соответствующий коду возврата, или Неопределено
Функция ЗвукПоКодуВозврата(Знач КодВозврата)

    Если ЭтоКодВозвратаУспех(КодВозврата) Тогда

        Возврат "success";

    ИначеЕсли ЭтоКодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду(КодВозврата) Тогда

        Возврат "error";

    ИначеЕсли ЭтоКодВозвратаСлишкомМногоВКоробе(КодВозврата) Тогда

        Возврат "error";

    ИначеЕсли ЭтоКодВозвратаОтсутствуетДокументНаВнутреннееПеремещение(КодВозврата) Тогда

        Возврат "error";

    ИначеЕсли ЭтоКодВозвратаШтрихкодУжеПроведен(КодВозврата) Тогда

        Возврат "error";

    ИначеЕсли ЭтоКодВозвратаШтрихкодУжеПроведенДругим(КодВозврата) Тогда

        Возврат "error";

    Иначе

        Возврат Неопределено;

    КонецЕсли;

КонецФункции

#КонецОбласти