#Область ПрограммныйИнтерфейс

// Процедура устанавливает флаг, указывающий на то, что проверка документа
// была завершена.
Процедура ЗавершитьПроверку() Экспорт

    ПроверкаЗавершена = Истина;

    Записать();

КонецПроцедуры

// Процедура обновляет количество принятого товара для данной номенклатуры.
// 
// Параметры:
//  НомерНоменклатуры - Число - Номер строки табличной части Номенклатура
//  НовоеКоличествоПринятогоТовара - Число
Процедура ОбновитьКоличествоПринятогоТовара(Знач НомерНоменклатуры, Знач НовоеКоличествоПринятогоТовара) Экспорт
                                            
    // 1. Получение строки табличной части Номенклатура
    СтрокаНоменклатуры = Номенклатура.Получить(НомерНоменклатуры - 1);
    
    // 2. Обновление количества принятого товара
    СтрокаНоменклатуры.КоличествоПринятогоТовара = НовоеКоличествоПринятогоТовара;

    Записать();

КонецПроцедуры

#КонецОбласти