// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудник = Параметры.Сотрудник;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроверкуЭлектроннойНакладной(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли
   
    // Открытие формы выбора 
    ПараметрыФормы = Новый Структура("Сотрудник", ФормаСотрудник);
    ОткрытьФорму("Обработка.ВыполнениеПриходов.Форма.ФормаВыбораЭлектроннойНакладной", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗаполнениеПоступленияПоБСО(Команда)

#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли
   
    // Открытие формы выбора 
    ПараметрыФормы = Новый Структура("Сотрудник", ФормаСотрудник);
    ОткрытьФорму("Обработка.ВыполнениеПриходов.Форма.ФормаВыбораПоступления", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти