#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает имя внешней компоненты.
// 
// Возвращаемое значение:
//  Строка - Имя
Функция ПолучитьИмя() Экспорт

    Возврат "Scanner.NewlandN7CachalotPro";

КонецФункции

// Процедура настраивает драйвер для сканера штрихкода Newland N7 Cachalot Pro и добавляет его в
// коллекцию ВнешниеКомпоненты.
// 
// Параметры:
//  ВнешниеКомпоненты - См. ВнешниеКомпонентыМенеджерКлиент.СоздатьКоллекциюВнешнихКомпонент
Процедура НастроитьДрайвер(ВнешниеКомпоненты) Экспорт

    // Вызов УстановитьВнешнююКомпоненту
    МестоположениеДрайвера = УстановитьДрайвер();
    
    // Вызов ПодключитьВнешнююКомпоненту и настройка драйвера
    ОбъектДрайвера = ПодключитьДрайвер(МестоположениеДрайвера);
    
    // Добавление драйвера в коллекцию ВнешниеКомпоненты
    ВнешниеКомпоненты.Вставить(ПолучитьИмя(), ОбъектДрайвера);

КонецПроцедуры

// Процедура посылает оповещение
// 
// Параметры:
//  ОписаниеВнешнегоСобытия - См. ВнешниеКомпонентыМенеджерКлиент.СоздатьОписаниеВнешнегоСобытия
Процедура ОбработатьВнешнееСобытие(ОписаниеВнешнегоСобытия) Экспорт

    Событие = ОписаниеВнешнегоСобытия.Событие;
    Штрихкод = ОписаниеВнешнегоСобытия.Данные;

    Оповестить(Событие, Штрихкод, "ПодключаемоеОборудование");

КонецПроцедуры

// Процедура отключает драйвер.
// 
// Параметры:
//  ВнешняяКомпонента - Произвольный
Процедура ОтключитьДрайвер(ВнешняяКомпонента) Экспорт

    ВнешняяКомпонента.Отключить(ПолучитьИмя());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция устанавливает драйвер и возвращает местоположение, по которому
// он был найден. Если при установке возникла ошибка, функция вызывает исключение.
// 
// Возвращаемое значение:
//  Строка - Местоположение драйвера
Функция УстановитьДрайвер()

    МестоположениеДрайвера = "ОбщийМакет.Драйвер1ССканерШтрихкода";

    Попытка
        
        //@skip-check bsl-legacy-check-static-feature-access
        УстановитьВнешнююКомпоненту(МестоположениеДрайвера);

    Исключение

        СообщениеОбОшибке = СтрШаблон("Ошибка при установке внешней компоненты '%1': %2",
                                      МестоположениеДрайвера,
                                      ОписаниеОшибки());
        ВызватьИсключение СообщениеОбОшибке;

    КонецПопытки;

    Возврат МестоположениеДрайвера;

КонецФункции

// Функция подключает драйвер и устанавливает ему параметры. Если при подключении
// или установке параметров произошла ошибка, функция вызывает исключение. 
// 
// Параметры:
//  МестоположениеДрайвера - Строка - Местоположение драйвера
// 
// Возвращаемое значение:
//  Произвольный - Объект драйвера
Функция ПодключитьДрайвер(МестоположениеДрайвера)

    // Подключение внешней компоненты
    ВнешняяКомпонентаПодключена = ПодключитьВнешнююКомпоненту(МестоположениеДрайвера,
                                                              "InputDevice",
                                                              ТипВнешнейКомпоненты.Native);

    Если Не ВнешняяКомпонентаПодключена Тогда

        СообщениеОбОшибке = СтрШаблон("Ошибка при подключении внешней компоненты '%1'", МестоположениеДрайвера);
        ВызватьИсключение СообщениеОбОшибке;

    КонецЕсли;

    // Создание объекта драйвера
    ВидОбъектаДрайвера = "AddIn.InputDevice.InputDevice";

    Попытка

        ОбъектДрайвера = Новый (ВидОбъектаДрайвера);

        // Настройка объекта драйвера
        ОбъектДрайвера.УстановитьПараметр("EquipmentType", "УстройствоВвода");
        ОбъектДрайвера.УстановитьПараметр("BluetoothDevice", "BROADCAST");
        ОбъектДрайвера.УстановитьПараметр("Action", "nlscan.action.SCANNER_RESULT"); // Сообщение Android Broadcast
        ОбъектДрайвера.УстановитьПараметр("ExtraType", "String");
        ОбъектДрайвера.УстановитьПараметр("Extra", "SCAN_BARCODE1"); // Данные в сообщении
		
    Исключение

        СообщениеОбОшибке = СтрШаблон("Ошибка при настройке объекта '%1' при настройке внешней компоненты '%2': %3",
                                      ВидОбъектаДрайвера,
                                      МестоположениеДрайвера,
                                      ОписаниеОшибки());
        ВызватьИсключение СообщениеОбОшибке;

    КонецПопытки;

    // Подключение объекта драйвера
    ОбъектДрайвераПодключен = ОбъектДрайвера.Подключить(ПолучитьИмя());

    Если Не ОбъектДрайвераПодключен Тогда

        СообщениеОбОшибке = СтрШаблон("Ошибка при подключении объекта '%1' при настройке внешней компоненты '%2'",
                                      ВидОбъектаДрайвера,
                                      МестоположениеДрайвера);
        ВызватьИсключение СообщениеОбОшибке;

    КонецЕсли;

    Возврат ОбъектДрайвера;

КонецФункции

#КонецОбласти

#КонецЕсли