// @strict-types
#Область ПрограммныйИнтерфейс

// Функция определяет существует ли номенклатура с данным штрихкодом и либо добавляет товар
// в поступление товаров, либо увеличивает счетчик количества.
// 
// Параметры:
//  ПоступлениеТоваров - ДокументСсылка.ПоступлениеТоваров
//  ШтрихкодТовара - Строка
// 
// Возвращаемое значение:
//  См. НовоеОписаниеОбработкиШтрихкода
Функция ОбработатьШтрихкодТовара(Знач ПоступлениеТоваров, Знач ШтрихкодТовара) Экспорт

    НачатьТранзакцию();

    Попытка

        ОписаниеОбработкиШтрихкода = НовоеОписаниеОбработкиШтрихкода();
        
        // 1. Поиск номенклатуры по штрихкоду 
        Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                              |    ВсеШтрихкодыНоменклатуры.Ссылка КАК Номенклатура
                              |ИЗ
                              |    Справочник.НоменклатураРозница.Штрихкоды КАК ВсеШтрихкодыНоменклатуры
                              |ГДЕ
                              |    ВсеШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");

        Запрос.УстановитьПараметр("Штрихкод", ШтрихкодТовара);
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();

        Если Не Выборка.Следующий() Тогда

            ОтменитьТранзакцию();

            ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаНеНайденаНоменклатура();

            Возврат ОписаниеОбработкиШтрихкода;

        КонецЕсли;

        //@skip-check property-return-type
        НоменклатураТовара = Выборка.Номенклатура; // СправочникСсылка.НоменклатураРозница
        
        // 2. Получение существующего ил добавление нового товара в перемещение
        Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                              |    ВсеТовары.НомерСтроки КАК НомерТовара
                              |ИЗ
                              |    Документ.ПоступлениеТоваров.Товары КАК ВсеТовары
                              |ГДЕ
                              |    ВсеТовары.Ссылка = &Документ
                              |    И ВсеТовары.Номенклатура = &Номенклатура
                              |    И ВсеТовары.Штрихкод = &Штрихкод");

        Запрос.УстановитьПараметр("Документ", ПоступлениеТоваров);
        Запрос.УстановитьПараметр("Номенклатура", НоменклатураТовара);
        Запрос.УстановитьПараметр("Штрихкод", ШтрихкодТовара);
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();

        ПоступлениеТоваровОбъект = ПоступлениеТоваров.ПолучитьОбъект();

        ТоварЕстьВПоступлении = Выборка.Следующий();

        Товар = ?(ТоварЕстьВПоступлении,
                  ТоварИзПоступления(ПоступлениеТоваровОбъект, Выборка),
                  НовыйТоварВПоступлении(ПоступлениеТоваровОбъект, НоменклатураТовара, ШтрихкодТовара));   
        
        // 4. Увеличение счетчика количества для найденного товара
        ОписаниеОбработкиШтрихкода.НомерТовара = Товар.НомерСтроки;
        ОписаниеОбработкиШтрихкода.ПредыдущееКоличество = Товар.Количество;

        Товар.Количество = Товар.Количество + 1;

        ОписаниеОбработкиШтрихкода.НовоеКоличество = Товар.Количество;

        ПоступлениеТоваровОбъект.Записать();

        ОписаниеОбработкиШтрихкода.КодВозврата = КодВозвратаУспех();

        ЗафиксироватьТранзакцию();

        Возврат ОписаниеОбработкиШтрихкода;

    Исключение

        ОтменитьТранзакцию();
        ВызватьИсключение;

    КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция создает описание обработки штрихкода.
// 
// Возвращаемое значение:
//  Структура - Описание обработки штрихкода:
// * КодВозврата - Число - Код, указывающий на результат обработки штрихкода
// * НомерТовара - Неопределено, Число - Номер строки табличной части "Товары" документа "ПеремещениеТоваров",
//                                       которой соответствовал обрабатываемый штрихкод
// * ПредыдущееКоличество - Неопределено, Число - Значение реквизита "Количество" до обработки штрихкода
// * НовоеКоличество - Неопределено, Число - Значение реквизита "Количество" после обработки штрихкода
Функция НовоеОписаниеОбработкиШтрихкода() Экспорт

    ОписаниеОбработкиШтрихкода = Новый Структура;

    ОписаниеОбработкиШтрихкода.Вставить("КодВозврата", КодВозвратаУспех());
    ОписаниеОбработкиШтрихкода.Вставить("НомерТовара", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("ПредыдущееКоличество", Неопределено);
    ОписаниеОбработкиШтрихкода.Вставить("НовоеКоличество", Неопределено);

    Возврат ОписаниеОбработкиШтрихкода;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция извлекает номер товара из результата запроса и по нему строку
// из табличной части "Товары".
// 
// Параметры:
//  ПоступлениеТоваровОбъект - ДокументОбъект.ПоступлениеТоваров
//  Выборка - ВыборкаИзРезультатаЗапроса
// 
// Возвращаемое значение:
//  СтрокаТабличнойЧасти - Строка табличной части "Товары"  
Функция ТоварИзПоступления(ПоступлениеТоваровОбъект, Выборка)
    
    //@skip-check property-return-type
    НомерТовара = Выборка.НомерТовара; // Число
    Возврат ПоступлениеТоваровОбъект.Товары.Получить(НомерТовара - 1);

КонецФункции

// Функция добавляет новую строку в табличную часть "Товары".
// 
// Параметры:
//  ПоступлениеТоваровОбъект - ДокументОбъект.ПоступлениеТоваров
//  Номенклатура - СправочникСсылка.НоменклатураРозница
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  СтрокаТабличнойЧасти - Строка табличной части "Товары" 
Функция НовыйТоварВПоступлении(ПоступлениеТоваровОбъект, Номенклатура, Штрихкод)

    НовыйТовар = ПоступлениеТоваровОбъект.Товары.Добавить();

    НовыйТовар.Номенклатура = Номенклатура;
    НовыйТовар.Количество = 0;
    НовыйТовар.Штрихкод = Штрихкод;

    Возврат НовыйТовар;

КонецФункции

#КонецОбласти