// @strict-types
#Область ПрограммныйИнтерфейс

// Функция определяет тип штрихкода.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипШтрихкода, Неопределено - Тип штрихкода
Функция ТипШтрихкода(Штрихкод) Экспорт

    ДлинаШтрихкода = СтрДлина(Штрихкод);

    Если ДлинаШтрихкода = 9 Тогда

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.ТШК");

    КонецЕсли;

    Если ДлинаШтрихкода = 3 Тогда // TODO: Исправить на 129

        Возврат ПредопределенноеЗначение("Перечисление.ТипШтрихкода.DataMatrix");

    КонецЕсли;

    Возврат Неопределено;

КонецФункции

#КонецОбласти