// @strict-types
#Область ПрограммныйИнтерфейс

// Функция извлекает GTIN из штрихкода.
// 
// Параметры:
//  Штрихкод - Строка - GTIN или код маркировки GS1.
// 
// Возвращаемое значение:
//  Неопределено, Строка - Строковое представление GTIN
Функция GTINИзШтрихкода(Штрихкод) Экспорт
    
    // 1. Проверка, что штрихкод содержит только GTIN (длина GTIN не более 14 символов)
    Если СтрДлина(Штрихкод) <= 14 Тогда

        Попытка

            Возврат Формат(Число(Штрихкод), "ЧГ=;");

        Исключение

            Возврат Неопределено;

        КонецПопытки;

    КонецЕсли;
    
    // 2. Попытка извлечь GTIN на случай, если штрихкод - код маркироровки (в GS1 DataMatrix начало GTIN отмечается "01")
    ПрефиксGTIN = "01";
    ПозицияПрефиксаGTIN = СтрНайти(Штрихкод, ПрефиксGTIN);

    Если ПозицияПрефиксаGTIN = 0 Тогда

        Возврат Неопределено;

    КонецЕсли;

    ПозицияGTIN = ПозицияПрефиксаGTIN + СтрДлина(ПрефиксGTIN);
    GTINСЛидирующимиНулями = Сред(Штрихкод, ПозицияGTIN, 14);

    Попытка

        Возврат Формат(Число(GTINСЛидирующимиНулями), "ЧГ=;");

    Исключение

        Возврат Неопределено;

    КонецПопытки;

КонецФункции 

#КонецОбласти