// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура устанавливает статус задания в значение, соответствующее
// заданию, которое выполняется (из в ТШК 1С 7.7).
Процедура НачатьВыполнение() Экспорт

    Статус = Перечисления.СтатусЗадания.Выполняется;
    Записать();

КонецПроцедуры

// Процедура устанавливает статус задания в значение, соответствующее
// выполненному заданию (из в ТШК 1С 7.7), и помечает документ на удаление.
Процедура Закрыть() Экспорт

    Статус = Перечисления.СтатусЗадания.Закрыто;
    Записать();

    УстановитьПометкуУдаления(Истина);

КонецПроцедуры

// Функция возвращает значение реквизита "Количество".
// 
// Параметры:
//  НомерЗаданияНаОтбор - Число - Номер строки табличной части "ЗаданияНаОтбор"
//
// Возвращаемое значение:
//  Число
Функция КоличествоВЗаданииНаОтбор(Знач НомерЗаданияНаОтбор) Экспорт

    Возврат ЗаданияНаОтбор[НомерЗаданияНаОтбор - 1].Количество;

КонецФункции

// Функция уменьшает количество в задании на отбор на 1.
// 
// Параметры:
//  НомерЗаданияНаОтбор - Число - Номер строки табличной части "ЗаданияНаОтбор"
// 
// Возвращаемое значение:
//  Число - Новое количество
Функция УменьшитьКоличество(Знач НомерЗаданияНаОтбор) Экспорт

    ЗаданиеНаОтбор = ЗаданияНаОтбор[НомерЗаданияНаОтбор - 1];

    ПредыдущееКоличество = ЗаданиеНаОтбор.Количество;

    ЗаданиеНаОтбор.Количество = ПредыдущееКоличество - 1;

    Записать();

    Возврат ПредыдущееКоличество;

КонецФункции

// Функция изменяет количество в задании на отбор.
// 
// Параметры:
//  НомерЗаданияНаОтбор - Число - Номер строки табличной части "ЗаданияНаОтбор"
//  НовоеКоличество - Число
Процедура УстановитьКоличество(Знач НомерЗаданияНаОтбор, Знач НовоеКоличество) Экспорт

    ЗаданияНаОтбор[НомерЗаданияНаОтбор - 1].Количество = НовоеКоличество;
    Записать();

КонецПроцедуры

#КонецОбласти