// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура устанавливает статус задания в значение, соответствующее
// заданию, которое выполняется (из в ТШК 1С 7.7).
Процедура УстановитьСтатусВыполняется() Экспорт

    Статус = Перечисления.СтатусЗадания.Выполняется;
    Записать();

КонецПроцедуры

// Процедура устанавливает статус задания в значение, соответствующее
// выполненному заданию (из в ТШК 1С 7.7).
Процедура УстановитьСтатусЗакрыто() Экспорт

    Статус = Перечисления.СтатусЗадания.Закрыто;
    Записать();

КонецПроцедуры

#КонецОбласти