// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура помечает документ на удаление.
Процедура ЗавершитьВыполнение() Экспорт

    УстановитьПометкуУдаления(Истина);

КонецПроцедуры

// Функция возвращает значение реквизита "Количество".
// 
// Параметры:
//  НомерЗаданияНаОтбор - Число - Номер строки табличной части "ЗаданияНаОтбор"
//
// Возвращаемое значение:
//  Число
Функция КоличествоВЗаданииНаОтбор(Знач НомерЗаданияНаОтбор) Экспорт

    Возврат ЗаданияНаОтбор[НомерЗаданияНаОтбор - 1].Количество;

КонецФункции

#КонецОбласти