// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудник = Параметры.Сотрудник;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    АвтоЗаголовок = Ложь;
    Заголовок = "Выбор эл. накл.";

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокАктовПриемкиТоваров.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАктовПриемкиТоваров

// Процедура открывает форму для проверки электронной накладной.
// 
// Параметры:
//  Элемент - ТаблицаФормы
//  Значение - Произвольный
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокАктовПриемкиТоваровВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Документ", Значение);
    ПараметрыФормы.Вставить("Сотрудник", ФормаСотрудник);

    ОткрытьФорму("Документ.АктПриемкиТоваров.Форма.ФормаПроверки", ПараметрыФормы);

    Закрыть();

КонецПроцедуры

#КонецОбласти