// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаСотрудник = Параметры.Сотрудник;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
    
    АвтоЗаголовок = Ложь;
    Заголовок = "Выбор эл. накл.";

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокАктовПриемкиТоваров.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЭлектронныхНакладных

// Процедура открывает форму для проверки электронной накладной.
// 
// Параметры:
//  Элемент - ТаблицаФормы
//  Значение - Произвольный
//  СтандартнаяОбработка - Булево
&НаКлиенте
Процедура СписокЭлектронныхНакладныхВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Ключ", Значение);
    ПараметрыФормы.Вставить("Сотрудник", ФормаСотрудник);

    ОткрытьФорму("Документ.АктПриемкиТоваров.Форма.ФормаПроверки", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти