// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьКонтрольОтбора);

    Если Не ТекущийПользовательИмеетПравоВыполнятьИнвентаризациюОбуви() Тогда

        СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьИнвентаризацияОбуви);

    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессКонтрольОтбора(Команда)
    
#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли
   
    // Открытие формы выбора 
    ПараметрыФормы = Новый Структура("Комплектовщик", ФормаКомплектовщик);
    ОткрытьФорму("Обработка.ВыполнениеКонтроляОтбора.Форма.ФормаВыбораЗадания", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессИнвентаризацияОбуви(Команда)
    
#Если Не МобильныйКлиент И Не МобильноеПриложениеКлиент Тогда

    Закрыть();

#КонецЕсли
   
    // Открытие формы выбора 
    ПараметрыФормы = Новый Структура("Комплектовщик", ФормаКомплектовщик);
    ОткрытьФорму("Обработка.ВыполнениеИнвентаризации.Форма.ФормаВыбораИнвентаризацииОбуви", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекущийПользовательИмеетПравоВыполнятьИнвентаризациюОбуви()

    Возврат Истина;

КонецФункции

// Процедура добавляет астериск в начале заголовка и отключает доступность кнопки.
// 
// Параметры:
//  Кнопка - КнопкаФормы
&НаКлиенте
Процедура СделатьКнопкуНедоступной(Кнопка)

    Кнопка.Заголовок = "* " + Кнопка.Заголовок;
    Кнопка.Доступность = Ложь;

КонецПроцедуры

#КонецОбласти