// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаКомплектовщик = Параметры.Комплектовщик;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

    Если Не ТекущийПользовательИмеетПравоВыполнятьИнвентаризациюОбуви() Тогда

        СделатьКнопкуНедоступной(Элементы.КнопкаВыбратьИнвентаризацияОбуви);

    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроцессКонтрольОтбора(Команда)
    
    ОповещенияПользователяКлиент.ПоказатьОповещение("Процесс не поддерживается", "Контроль отбора", ИмяФормы);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроцессИнвентаризацияОбуви(Команда)
    
    ОповещенияПользователяКлиент.ПоказатьОповещение("Процесс не поддерживается", "Инвентаризация обвуи", ИмяФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ТекущийПользовательИмеетПравоВыполнятьИнвентаризациюОбуви()

    Возврат Истина;

КонецФункции

// Процедура добавляет астериск в начале заголовка и отключает доступность кнопки.
// 
// Параметры:
//  Кнопка - КнопкаФормы
&НаКлиенте
Процедура СделатьКнопкуНедоступной(Кнопка)

    Кнопка.Заголовок = "* " + Кнопка.Заголовок;
    Кнопка.Доступность = Ложь;

КонецПроцедуры

#КонецОбласти