// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаЗадание = Параметры.Задание;
    ФормаКомплектовщик = Параметры.Комплектовщик;

    ФормаСписокЗаданийНаОтбор.Параметры.УстановитьЗначениеПараметра("Задание", ФормаЗадание);
    ФормаСписокЗаданийНаОтбор.Параметры.УстановитьЗначениеПараметра("Комплектовщик", ФормаКомплектовщик);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    Элементы.СписокЗаданийНаОтбор.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьШтрихкодСФормы(Команда)

    ОбработатьШтрихкод(ФормаШтрихкод);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает ключ уникальности оповещений пользователя.
// 
// Возвращаемое значение:
//  Строка - Ключ уникальности оповещений пользователя
&НаКлиенте
Функция КлючУникальностиОповещенийПользователя()

    Возврат ИмяФормы;

КонецФункции

// Процедура определяет тип штрихокда и в зависимости от типа выполняет
// его обработку.
// 
// Параметры:
//  Штрихкод - Строка - Штрихкод
&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)

    Тип = ОбработкаШтрихкодовКлиентСервер.ТипШтрихкода(Штрихкод);

    Если Тип = Неопределено Тогда

        ОповещенияПользователяКлиент.ПоказатьВажноеОповещениеОшибка("Неверный штрихкод",
                                                                    Штрихкод,
                                                                    КлючУникальностиОповещенийПользователя());

    ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.ТШК") Тогда

        ОповещенияПользователяКлиент.ПоказатьОповещение("ТШК", Штрихкод, КлючУникальностиОповещенийПользователя());

    ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.DataMatrix") Тогда

        ОповещенияПользователяКлиент.ПоказатьОповещение("КМ31", Штрихкод, КлючУникальностиОповещенийПользователя());

    КонецЕсли;

КонецПроцедуры

#КонецОбласти