// @strict-types
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ФормаЗадание = Параметры.Задание;
    ФормаКомплектовщик = Параметры.Комплектовщик;

    ФормаСписокЗаданийНаОтбор.Параметры.УстановитьЗначениеПараметра("Задание", ФормаЗадание);
    ФормаСписокЗаданийНаОтбор.Параметры.УстановитьЗначениеПараметра("Комплектовщик", ФормаКомплектовщик);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

    ОбновитьОстаткиПоЗаданию();

#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда

    // Отключение видимости шапки динамического списка, чтобы сэкономить место на экране 
    Элементы.СписокЗаданийНаОтбор.Шапка = Ложь;

#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

    Если ВводДоступен() И ИмяСобытия = ОповещенияФормыКлиент.ИмяСобытияСканированияШтрихкода() Тогда

        Штрихкод = Строка(Параметр);

        ОбработатьШтрихкод(Штрихкод);

    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШтрихкодИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
    
     Элементы.КнопкаОбработатьШтрихкод.Доступность = ЗначениеЗаполнено(Текст);
     
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьШтрихкодСФормы(Команда)

    ОбработатьШтрихкод(ФормаШтрихкод);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает ключ уникальности оповещений пользователя.
// 
// Возвращаемое значение:
//  Строка
&НаКлиенте
Функция КлючУникальностиОповещенийПользователя()

    Возврат ИмяФормы;

КонецФункции

// Процедура определяет тип штрихокда и выполняет
// его обработку в зависимости от типа.
// 
// Параметры:
//  Штрихкод - Строка
&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)

    Перем ОписаниеОбработкиШтрихкода; // См. КонтрольОтбора.НовоеОписаниеОбработкиШтрихкода

    // 1. Определение типа штрихкода
    Тип = ШтрихкодыКлиентСервер.ТипШтрихкода(Штрихкод);

    // 2.1. Остановить обработку, если не удалось определить тип штрихкода
    Если Тип = Неопределено Тогда

        ПоказатьОповещениеОбОшибкеСканирования(Штрихкод);

        Возврат;

    // 2.2. Обработка штрихкода короба
    ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.ТШК") Тогда

        ПоказатьОповещениеОбУспешномСканировании(Тип, "Обработка ТШК", Штрихкод);

        ОписаниеОбработкиШтрихкода = ОбработатьШтрихкодКороба(Штрихкод);

    // 2.3. Обработка штрихкода россыпи
    ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.ТипШтрихкода.DataMatrix") Тогда

        ПоказатьОповещениеОбУспешномСканировании(Тип, "Обработка КМ31", Штрихкод);

        ОписаниеОбработкиШтрихкода = ОбработатьШтрихкодРоссыпи(Штрихкод);

    КонецЕсли;
    
    // 3.1. Оповещение об успешной обработке
    Если ЭтоКодВозвратаУспех(ОписаниеОбработкиШтрихкода.КодВозврата) Тогда

        ЗаголовокОповещения = СтрШаблон("Задание на отбор %1 обработано",
                                        ОписаниеОбработкиШтрихкода.НомерЗаданияНаОтбор);
        ПояснениеОповещения = СтрШаблон("Количество %1 → %2",
                                        ОписаниеОбработкиШтрихкода.ПредыдущееКоличество,
                                        ОписаниеОбработкиШтрихкода.НовоеКоличество);

        ПоказатьОповещение(ОписаниеОбработкиШтрихкода.КодВозврата, ЗаголовокОповещения, ПояснениеОповещения);

        ОбновитьФорму();

    // 3.2. Оповещение о том, что задание на отбор не найдено
    ИначеЕсли ЭтоКодВозвратаНеНайденоЗаданиеНаОтборПоШтрихкоду(ОписаниеОбработкиШтрихкода.КодВозврата) Тогда

        ПоказатьВажноеОповещениеОбОшибкеДляКодаВозврата(ОписаниеОбработкиШтрихкода.КодВозврата,
                                                        "Задание на отбор не найдено",
                                                        Штрихкод);
                                                        
    // 3.3. Оповещение о том, что задание на отбор не найдено
    ИначеЕсли ЭтоКодВозвратаСлишкомМногоВКоробе(ОписаниеОбработкиШтрихкода.КодВозврата) Тогда

        ВКоробе = ОписаниеОбработкиШтрихкода.ПредыдущееКоличество - ОписаниеОбработкиШтрихкода.НовоеКоличество;
        ПояснениеОповещения = СтрШаблон("%1 ↘ %2", ВКоробе, ОписаниеОбработкиШтрихкода.ПредыдущееКоличество);

        ПоказатьВажноеОповещениеОбОшибкеДляКодаВозврата(ОписаниеОбработкиШтрихкода.КодВозврата,
                                                        "В коробе больше чем в задании",
                                                        ПояснениеОповещения);
                                                                    
    // 3.4. Оповещение о том, что у задания отсутствует документ на перемещение
    ИначеЕсли ЭтоКодВозвратаОтсутствуетДокументНаВнутреннееПеремещение(ОписаниеОбработкиШтрихкода.КодВозврата) Тогда

        ПоказатьВажноеОповещениеОбОшибкеДляКодаВозврата(ОписаниеОбработкиШтрихкода.КодВозврата,
                                                        "Нет документа на перемещение",
                                                        "Возможно, в задании ошибка");
                                                                    
    // 3.5. Оповещение о том, что у штрихкод уже был проведен
    ИначеЕсли ЭтоКодВозвратаШтрихкодУжеПроведен(ОписаниеОбработкиШтрихкода.КодВозврата) Тогда

        ПоказатьВажноеОповещениеОбОшибкеДляКодаВозврата(ОписаниеОбработкиШтрихкода.КодВозврата,
                                                        "Штрихкод уже был проведен",
                                                        Строка(ОписаниеОбработкиШтрихкода.ДатаПредыдущегоСканирования));
                                                                    
    // 3.6. Оповещение о том, что у штрихкод уже был проведен другим комплектовщиком
    ИначеЕсли ЭтоКодВозвратаШтрихкодУжеПроведенДругим(ОписаниеОбработкиШтрихкода.КодВозврата) Тогда

        ПояснениеОповещения = СтрШаблон("%1 (%2)",
                                        ОписаниеОбработкиШтрихкода.ДатаПредыдущегоСканирования,
                                        ОписаниеОбработкиШтрихкода.КомплектовщикПредыдущегоСканирования);

        ПоказатьВажноеОповещениеОбОшибкеДляКодаВозврата(ОписаниеОбработкиШтрихкода.КодВозврата,
                                                        "Штрихкод уже был проведен другим",
                                                        ПояснениеОповещения);

    КонецЕсли;

КонецПроцедуры

// Процедура обрабатывает штрихкод короба.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  См. КонтрольОтбора.НовоеОписаниеОбработкиШтрихкода
&НаСервере
Функция ОбработатьШтрихкодКороба(Знач Штрихкод)

    Возврат КонтрольОтбора.ОбработатьШтрихкодКороба(ФормаЗадание, ФормаКомплектовщик, Штрихкод);

КонецФункции

// Процедура обрабатывает штрихкод россыпи.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  См. КонтрольОтбора.НовоеОписаниеОбработкиШтрихкода
&НаСервере
Функция ОбработатьШтрихкодРоссыпи(Знач Штрихкод)

    Возврат КонтрольОтбора.ОбработатьШтрихкодРоссыпи(ФормаЗадание, ФормаКомплектовщик, Штрихкод);

КонецФункции

// Процедура обновляет список заданий на отбор и, если он пуст, отображает
// задание как выполненное.
&НаКлиенте
Процедура ОбновитьФорму()

    ОбновитьОстаткиПоЗаданию();

    Элементы.СписокЗаданийНаОтбор.Обновить();

    Если ЗаданиеВыполненоДляКомплектовщика(ФормаЗадание, ФормаКомплектовщик) Тогда

        Элементы.Комплектовщик.Заголовок = "Выполнил";

        Элементы.СписокЗаданийНаОтбор.Видимость = Ложь;
        Элементы.ВводШтрихкода.Видимость = Ложь;

        Элементы.ПодсказкаЗаданиеВыполнено.Видимость = Истина;

        ОповещенияПользователяКлиент.ПоказатьВажноеОповещениеУспех("Задание выполнено",
                                                                   Строка(ФормаЗадание),
                                                                   КлючУникальностиОповещенийПользователя());

    КонецЕсли;

КонецПроцедуры

// Процедура обновляет показатели остатков по заданию на форме.
&НаКлиенте
Процедура ОбновитьОстаткиПоЗаданию()

    ОсталосьПоЗаданию = ОсталосьПоЗаданию(ФормаЗадание, ФормаКомплектовщик);
    ФормаОсталосьПоЗаданиюКоробов = ОсталосьПоЗаданию.Коробов;
    ФормаОсталосьПоЗаданиюКоробок = ОсталосьПоЗаданию.Коробок;

КонецПроцедуры

// См. КонтрольОтбора.ЗаданиеВыполненоДляКомплектовщика
&НаСервере
Функция ЗаданиеВыполненоДляКомплектовщика(Знач Задание, Знач Комплектовщик)

    Возврат КонтрольОтбора.ЗаданиеВыполненоДляКомплектовщика(Задание, Комплектовщик);

КонецФункции

// См. КонтрольОтбора.ОсталосьПоЗаданию
&НаСервере
Функция ОсталосьПоЗаданию(Знач Задание, Знач Комплектовщик)

    Возврат КонтрольОтбора.ОсталосьПоЗаданию(Задание, Комплектовщик);

КонецФункции

// Процедура воспроизводит звуковой сигнал, соответствующий коду возврата и 
// показывает оповещение.
// 
// Параметры:
//  КодВозврата - Число - См. КодыВозвратаСерверГлобальный
//  Заголовок - Строка
//  Пояснение - Строка
&НаКлиенте
Процедура ПоказатьОповещение(Знач КодВозврата, Знач Заголовок, Знач Пояснение)

#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда

    СредстваМультимедиаКлиент.ВоспроизвестиЗвуковоеОповещениеДляКодаВозврата(КодВозврата);

#КонецЕсли

    ОповещенияПользователяКлиент.ПоказатьОповещение(Заголовок, Пояснение, КлючУникальностиОповещенийПользователя());

КонецПроцедуры

// Процедура воспроизводит звуковой сигнал, соответствующий ошибке сканирования штрихкода и 
// показывает важное оповещение об ошибке.
// 
// Параметры:
//  Штрихкод - Строка
&НаКлиенте
Процедура ПоказатьОповещениеОбОшибкеСканирования(Знач Штрихкод)

#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда

    СредстваМультимедиаКлиент.ВоспроизвестиЗвуковоеОповещениеОбОшибкеСканированияШтрихкода();

#КонецЕсли

    ОповещенияПользователяКлиент.ПоказатьОповещение("Неверный штрихкод",
                                                    Штрихкод,
                                                    КлючУникальностиОповещенийПользователя());

КонецПроцедуры

// Процедура воспроизводит звуковой сигнал, соответствующий типу штрихкода и 
// показывает оповещение.
// 
// Параметры:
//  Тип - ПеречислениеСсылка.ТипШтрихкода
//  Заголовок - Строка
//  Пояснение - Строка
&НаКлиенте
Процедура ПоказатьОповещениеОбУспешномСканировании(Знач Тип, Знач Заголовок, Знач Пояснение)

#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда

    СредстваМультимедиаКлиент.ВоспроизвестиЗвуковоеОповещениеОбУспешномСканированииШтрихкода(Тип);

#КонецЕсли

    ОповещенияПользователяКлиент.ПоказатьОповещение(Заголовок, Пояснение, КлючУникальностиОповещенийПользователя());

КонецПроцедуры

// Процедура воспроизводит звуковой сигнал, соответствующий коду возврата и 
// показывает важное оповещение об ошибке.
// 
// Параметры:
//  КодВозврата - Число - См. КодыВозвратаСерверГлобальный
//  Заголовок - Строка
//  Пояснение - Строка
&НаКлиенте
Процедура ПоказатьВажноеОповещениеОбОшибкеДляКодаВозврата(Знач КодВозврата, Знач Заголовок, Знач Пояснение)

#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда

    СредстваМультимедиаКлиент.ВоспроизвестиЗвуковоеОповещениеДляКодаВозврата(КодВозврата);

#КонецЕсли

    ОповещенияПользователяКлиент.ПоказатьВажноеОповещениеОшибка(Заголовок,
                                                                Пояснение,
                                                                КлючУникальностиОповещенийПользователя());

КонецПроцедуры

#КонецОбласти